<a href="https://colab.research.google.com/github/4dsolutions/clarusway_data_analysis/blob/main/DAwPy_S7_(Handling_with_Missing_Values)/DAwPy_S7_(Handling_with_Missing_Values).ipynb"><img align="left" src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open in Colab" title="Open and Execute in Google Colaboratory"></a><br/>
[![nbviewer](https://raw.githubusercontent.com/jupyter/design/master/logos/Badges/nbviewer_badge.svg)](https://nbviewer.org/github/4dsolutions/clarusway_data_analysis/blob/main/DAwPy_S7_%28Handling_with_Missing_Values%29/DAwPy_S7_%28Handling_with_Missing_Values%29.ipynb)

___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" 
alt="CLRSWY"></p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:100%; text-align:center; border-radius:10px 10px;">WAY TO REINVENT YOURSELF</p>

<img src=https://i.ibb.co/6gCsHd6/1200px-Pandas-logo-svg.png width="700" height="200">

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:200%; text-align:center; border-radius:10px 10px;">Data Analysis with Python</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:150%; text-align:center; border-radius:10px 10px;">Session - 07</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#4d77cf; font-size:200%; text-align:center; border-radius:10px 10px;">Handling with Missing Values</p>

<a id="toc"></a>

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Content</p>

* [IMPORTING LIBRARIES NEEDED IN THIS NOTEBOOK](#0)
* [TYPE OF NAN VALUES](#1)
* [DETECTING MISSING VALUES](#2)
* [CONVERTING INAPPROPRIATE VALUES TO NAN VALUES](#3)    
* [MISSING VALUE HANDLING METHODS](#4)    
* [THE END OF THE SESSION - 07](#5)

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Importing Libraries Needed in This Notebook</p>

<a id="0"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Once you've installed NumPy & Pandas you can import them as a library:

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [6]:
type(np.nan)

float

In [7]:
id_no = ["P001", "P002", "P003", "P004", "P005", "P006", "P007", "P008", "P009", "P010", "P011"]
gender = ["M", "F", "M", "F", "M", "F", "M", "F", "M", "F", "M"]
status = ["FT", "PT", "-", "FT", "PT", "PT", "FT", "-", "PT", "FT", np.nan]
dept = ["DS", "FS", "AWS", "AWS", "DS", np.nan, "FS", "FS", np.nan, "DS", "AWS"]
V1 = np.array([2, 3, 5, np.nan, 7, 1, np.nan, 10, 14, "-", 6])
V2 = np.array([8, np.nan, 5, 8, 11, np.nan, np.nan, 2, 3, 7, 9])
salary = np.array([np.nan, 54, 59, 120, 58, 75, np.nan, 136, 60, 125, np.nan])

df = pd.DataFrame({
                   "id" : id_no,
                   "gender": gender,
                   "status": status,
                   "dept": dept,
                   "var1" : V1,
                   "var2" : V2,
                   "salary" : salary
                  })
df

      id gender status dept var1  var2  salary
0   P001      M     FT   DS    2   8.0     NaN
1   P002      F     PT   FS    3   NaN    54.0
2   P003      M      -  AWS    5   5.0    59.0
3   P004      F     FT  AWS  nan   8.0   120.0
4   P005      M     PT   DS    7  11.0    58.0
5   P006      F     PT  NaN    1   NaN    75.0
6   P007      M     FT   FS  nan   NaN     NaN
7   P008      F      -   FS   10   2.0   136.0
8   P009      M     PT  NaN   14   3.0    60.0
9   P010      F     FT   DS    -   7.0   125.0
10  P011      M    NaN  AWS    6   9.0     NaN

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Type of NaN Values</p>

<a id="1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      11 non-null     object
 1   gender  11 non-null     object
 2   status  10 non-null     object
 3   dept    9 non-null      object
 4   var1    11 non-null     object
 5   var2    8 non-null      float64
 6   salary  8 non-null      float64
dtypes: float64(2), object(5)
memory usage: 744.0+ bytes

In [9]:
type(np.nan)

float

In [10]:
type(np.NaN)

float

In [11]:
type(None)

NoneType

In [14]:
df.salary

0       NaN
1      54.0
2      59.0
3     120.0
4      58.0
5      75.0
6       NaN
7     136.0
8      60.0
9     125.0
10      NaN
Name: salary, dtype: float64

In [15]:
type(df.salary[0])

numpy.float64

In [16]:
type(df.salary[1])

numpy.float64

In [17]:
df.status

0      FT
1      PT
2       -
3      FT
4      PT
5      PT
6      FT
7       -
8      PT
9      FT
10    NaN
Name: status, dtype: object

In [18]:
type(df.status[2])

str

In [19]:
type(df.status[10])

float

In [22]:
df.var1

0       2
1       3
2       5
3     nan
4       7
5       1
6     nan
7      10
8      14
9       -
10      6
Name: var1, dtype: object

In [23]:
type(df.var1[3])

str

In [24]:
type(df.var1[0])

str

In [25]:
type(df.var1[10])

str

**What is the None keyword in Python? [ANSWER](https://www.educative.io/edpresso/what-is-the-none-keyword-in-python)**


**What is the None keyword in Python? [ANSWER01](https://www.educative.io/edpresso/what-is-the-none-keyword-in-python), [ANSWER02](https://stackoverflow.com/questions/21095654/what-is-a-nonetype-object)**

**Difference between None and NaN in Pandas [ANSWER01](https://www.skytowner.com/explore/difference_between_none_and_nan_in_pandas), [ANSWER02](https://kegui.medium.com/what-is-the-difference-between-nan-none-pd-nan-and-np-nan-a8ee0532e2eb)**

**Difference between np.nan and np.NaN [ANSWER](https://stackoverflow.com/questions/53436339/difference-between-np-nan-and-np-nan)**

**Difference between nan and 'nan' in Python [ANSWER01](https://stackoverflow.com/questions/40309789/difference-between-nan-and-nan-in-python), [ANSWER02](https://towardsdatascience.com/navigating-the-hell-of-nans-in-python-71b12558895b)**

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Detecting Missing Values</p>

<a id="2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

**``NaN``**, standing for "Not A Number", is a numeric data type used to represent any value that is undefined or unpresentable.

For example, 0/0 is undefined as a real number and is, therefore, represented by NaN. The square root of a negative number is an imaginary number that cannot be represented as a real number, so, it is represented by NaN.

**``NaN``** is also assigned to variables, in a computation, that do not have values and have yet to be computed.

In [26]:
df

      id gender status dept var1  var2  salary
0   P001      M     FT   DS    2   8.0     NaN
1   P002      F     PT   FS    3   NaN    54.0
2   P003      M      -  AWS    5   5.0    59.0
3   P004      F     FT  AWS  nan   8.0   120.0
4   P005      M     PT   DS    7  11.0    58.0
5   P006      F     PT  NaN    1   NaN    75.0
6   P007      M     FT   FS  nan   NaN     NaN
7   P008      F      -   FS   10   2.0   136.0
8   P009      M     PT  NaN   14   3.0    60.0
9   P010      F     FT   DS    -   7.0   125.0
10  P011      M    NaN  AWS    6   9.0     NaN

In [27]:
df.isnull()

# df.isna()

       id  gender  status   dept   var1   var2  salary
0   False   False   False  False  False  False    True
1   False   False   False  False  False   True   False
2   False   False   False  False  False  False   False
3   False   False   False  False  False  False   False
4   False   False   False  False  False  False   False
5   False   False   False   True  False   True   False
6   False   False   False  False  False   True    True
7   False   False   False  False  False  False   False
8   False   False   False   True  False  False   False
9   False   False   False  False  False  False   False
10  False   False    True  False  False  False    True

In [28]:
df.notnull()

#df.notna()

      id  gender  status   dept  var1   var2  salary
0   True    True    True   True  True   True   False
1   True    True    True   True  True  False    True
2   True    True    True   True  True   True    True
3   True    True    True   True  True   True    True
4   True    True    True   True  True   True    True
5   True    True    True  False  True  False    True
6   True    True    True   True  True  False   False
7   True    True    True   True  True   True    True
8   True    True    True  False  True   True    True
9   True    True    True   True  True   True    True
10  True    True   False   True  True   True   False

In [29]:
# columns/variables containing any missing values

df.isnull().any()

id        False
gender    False
status     True
dept       True
var1      False
var2       True
salary     True
dtype: bool

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      11 non-null     object
 1   gender  11 non-null     object
 2   status  10 non-null     object
 3   dept    9 non-null      object
 4   var1    11 non-null     object
 5   var2    8 non-null      float64
 6   salary  8 non-null      float64
dtypes: float64(2), object(5)
memory usage: 744.0+ bytes

In [31]:
# rows containing any missing values

df.isnull().any(axis=1)

0      True
1      True
2     False
3     False
4     False
5      True
6      True
7     False
8      True
9     False
10     True
dtype: bool

In [32]:
df

      id gender status dept var1  var2  salary
0   P001      M     FT   DS    2   8.0     NaN
1   P002      F     PT   FS    3   NaN    54.0
2   P003      M      -  AWS    5   5.0    59.0
3   P004      F     FT  AWS  nan   8.0   120.0
4   P005      M     PT   DS    7  11.0    58.0
5   P006      F     PT  NaN    1   NaN    75.0
6   P007      M     FT   FS  nan   NaN     NaN
7   P008      F      -   FS   10   2.0   136.0
8   P009      M     PT  NaN   14   3.0    60.0
9   P010      F     FT   DS    -   7.0   125.0
10  P011      M    NaN  AWS    6   9.0     NaN

In [34]:
#number of missing values in the columns

df.isnull().sum()

id        0
gender    0
status    1
dept      2
var1      0
var2      3
salary    3
dtype: int64

In [35]:
#number of missing values in the all DataFrame

df.isnull().sum().sum()

9

In [36]:
df.salary.isnull()

0      True
1     False
2     False
3     False
4     False
5     False
6      True
7     False
8     False
9     False
10     True
Name: salary, dtype: bool

In [37]:
df.salary.isnull().any()

True

In [38]:
df.salary.isnull().sum()

3

In [39]:
# percentage of null values by columns

df.isnull().sum()/len(df)*100

id         0.000000
gender     0.000000
status     9.090909
dept      18.181818
var1       0.000000
var2      27.272727
salary    27.272727
dtype: float64

In [40]:
df.isnull().any(axis=1)

0      True
1      True
2     False
3     False
4     False
5      True
6      True
7     False
8      True
9     False
10     True
dtype: bool

In [42]:
# to examine rows having missing value

df[df.isnull().any(axis=1)]

      id gender status dept var1  var2  salary
0   P001      M     FT   DS    2   8.0     NaN
1   P002      F     PT   FS    3   NaN    54.0
5   P006      F     PT  NaN    1   NaN    75.0
6   P007      M     FT   FS  nan   NaN     NaN
8   P009      M     PT  NaN   14   3.0    60.0
10  P011      M    NaN  AWS    6   9.0     NaN

[Tilde operator in pandas versus Python](https://stackoverflow.com/questions/46054318/tilde-sign-in-pandas-dataframe)

In [43]:
# rows containing full of notnull values using "~"

df[~df.isnull().any(axis = 1)]

     id gender status dept var1  var2  salary
2  P003      M      -  AWS    5   5.0    59.0
3  P004      F     FT  AWS  nan   8.0   120.0
4  P005      M     PT   DS    7  11.0    58.0
7  P008      F      -   FS   10   2.0   136.0
9  P010      F     FT   DS    -   7.0   125.0

In [51]:
pd.DataFrame({"A": [True, True, False, False]})

       A
0   True
1   True
2  False
3  False

In [ ]:
df[df.isnull().all(axis=1)]

In [ ]:
# to examine rows having missing value for specific column

df[df["status"].isnull()]

In [ ]:
df

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Converting Inappropriate Values to NaN Values</p>

<a id="3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

- map()
- replace()

In [ ]:
df

In [ ]:
df["var1"].map({"1": "K", "2":"2"})

**Notes:** When **``arg``** parameter is a dictionary, values in Series that are NOT in the dictionary (as keys) are converted to NaN. However, if the dictionary is a dict subclass that defines __missing__ (i.e. provides a method for default values), then this default is used rather than NaN [SOURCE](https://www.w3resource.com/pandas/series/series-map.php#:~:text=The%20map()%20function%20is,a%20dict%20or%20a%20Series.&text=Mapping%20correspondence.&text=If%20'ignore'%2C%20propagate%20NaN,them%20to%20the%20mapping%20correspondence.).

In [ ]:
df["var1"].replace(to_replace="-", value=np.nan)

In [ ]:
df["var1"].replace("-", np.nan).astype("float")

In [ ]:
df.var1

In [ ]:
df["var1"] = df["var1"].replace("-", np.nan).astype("float")

In [ ]:
df["var1"]

In [ ]:
df

In [ ]:
df["status"] = df["status"].replace("-", np.nan)
df["status"]

In [ ]:
df

In [ ]:
df.isnull().sum()

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Missing Value Handling Methods</p>

<a id="4"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

 1. <b>Deleting (Dropping) Rows</b> ----->if it has more than 70-75% of missing values
    
 2. <b>Replacing (Filling) With Mean/Median/Mode (Imputation)</b>--->can be applied on a feature which has numeric data

 3. <b> Assigning An Unique Category</b>--->If a categorical feature has definite number of classes, we can assign another class
    
 4. <b>Predicting The Missing Values</b>---> we can predict the nulls with the help of a machine learning algorithm like linear regression

 5. <b>Using Algorithms Which Support Missing Values</b>--->KNN is a machine learning algorithm which works on the principle of distance measure.  This algorithm can be used when there are nulls present in the dataset.  KNN considers the missing values by taking the majority of the K nearest values

 ## 1 - Dropping
 
 - dropna()
 - drop()

In [ ]:
df

In [ ]:
# it removes the rows which contains any (at least one missing value) missing value

df.dropna(axis=0, how="any", thresh=None, inplace=False)

#how : {'any','all'}, default 'any', Determine if row or column is removed from DataFrame, when we have at least one NA or all NA.
#inplace : bool, default False, If True, do operation inplace and return None.
#thresh : Require that many non-NA values.

In [ ]:
# it removes the columns which contains any (at least one missing value) missing value

df.dropna(axis=1, how="any", thresh=None, inplace=False)

In [ ]:
df.dropna(axis=1, how="all", thresh=None, inplace=False)

* **``any``** : If any NA values are present, drop that row or column.
* **``all``** : If all values are NA, drop that row or column [Source](https://www.journaldev.com/33492/pandas-dropna-drop-null-na-values-from-dataframe).

In [ ]:
# let's create a column containing full of missing value

df["delete_me"] = np.nan
df

In [ ]:
# now let's drop the column containing full of missing value

df.dropna(axis = 1, how = "all", inplace = True)
df

In [ ]:
# Keep only the columns with at least 9 non-NA values.

df.dropna(axis=1, how="any", thresh=9)

**``thresh=N``** requires that a column has at least N **non-NaNs to survive.** [Source](https://stackoverflow.com/questions/51584906/thresh-in-dropna-for-dataframe-in-pandas-in-python/51584935)

In [ ]:
df.gender.map({"M":"Male", "F":"Female"})

In [ ]:
df.drop(index=[1, 3, 5])

In [ ]:
# df.drop(["var1", "var2"]) # gives an error

df.drop(["var1", "var2"], axis=1)

In [ ]:
df.drop(index=[1,3,5])

In [ ]:
df.drop(columns=["id", "var1"])

 ## 2 - Filling Missing Values (Imputation)

In [ ]:
df

 #### a.Filling with a specific value

In [ ]:
df.fillna(0)

In [ ]:
df["var1"]

In [ ]:
df["var1"].fillna(0)

 #### b. Filling with any Proper Value

In [ ]:
df["var1"].mean()

In [ ]:
df["var1"].fillna(df["var1"].mean())

In [ ]:
df["var1"].median()

In [ ]:
df["var1"].fillna(df["var1"].median())

In [ ]:
# df.mean() gives warning

dfnew = df.select_dtypes(include=np.number)
dfnew.mean()
# dfnew

In [ ]:
df

In [ ]:
df.fillna(dfnew.mean())

In [ ]:
df.fillna({"dept": "other", "var1": df.var1.mean(), "var2": df.var2.median()})

In [ ]:
dfnew.mean()[["var1", "var2"]]

In [ ]:
df.fillna(dfnew.mean()[["var1", "var2"]])

**where() Replace values where the condition is False.**

In [ ]:
df.notna()

In [ ]:
df

In [ ]:
# df.where(pd.notna(df), df.mean())

df.where(cond=df.notna(), other=dfnew.mean(), axis=1)

In [ ]:
df

In [ ]:
df.interpolate() # Fill NaN values using an interpolation method.

For more information about [interpolation](https://www.geeksforgeeks.org/python-pandas-dataframe-interpolate/)

 #### c.  Filling the Missing Values of Categorical Variables

In [ ]:
df

In [ ]:
df["dept"].mode()

In [ ]:
df["dept"].mode()[0]

In [ ]:
df["dept"].fillna(df["dept"].mode()[0])

In [ ]:
df["dept"].fillna(method = "bfill")

In [ ]:
df["status"].fillna(method = "ffill")

 #### d. Filling by condition & by Group of the Categorical Variables

In [ ]:
df

In [ ]:
df["dept"].fillna(method="ffill", inplace=True)
df

In [ ]:
df.loc[df["salary"]>=100, "status"]

In [ ]:
df.loc[df["salary"]<100, "status"]

In [ ]:
low_sal = df.loc[df["salary"]<100, "status"].mode()[0]
low_sal

In [ ]:
high_sal = df.loc[df["salary"]>=100, "status"].mode()[0]
high_sal

In [ ]:
df.loc[df["salary"]>=100,"status"]

In [ ]:
df

In [ ]:
df.loc[df["salary"]>=100,"status"].fillna(high_sal, inplace=True)
df.loc[df["salary"]<100,"status"].fillna(low_sal, inplace=True)
# df['salary'].fillna(df.loc[df["salary"]<100, "status"].mode()[0], inplace=True)
df

In [ ]:
view_high = df.loc[df["salary"]>=100,"status"]
view_low  = df.loc[df["salary"]<100,"status"]

In [ ]:
view_high

In [ ]:
view_low

In [ ]:
df.loc[df["salary"]>=100,"status"] = view_high.fillna(high_sal)
df.loc[df["salary"]<100,"status"]  = view_low.fillna(low_sal)

df

In [ ]:
df

In [ ]:
df.groupby(["gender", "dept"])["status"].apply(lambda x : x.mode()[0])

In [ ]:
df.groupby(["gender", "dept"])["status"].transform(lambda x : x.mode()[0])

In [ ]:
df["trans_status"] = df.groupby(["gender", "dept"])["status"].transform(lambda x : x.mode()[0])
df

**Let's fill the missing values at "status" column with the mode of the group of "gender" and "dept"**

In [ ]:
df['status'] = df["status"].fillna(df["trans_status"])
df

In [ ]:
# regarding to avg of "salary" in terms of "department"

df.groupby("dept")["salary"].mean()

In [ ]:
# we transformed the values of "salary" column into group average.

df.groupby("dept")["salary"].transform("mean")

In [ ]:
df["salary"].fillna(df.groupby("dept")["salary"].transform("mean"))

In [ ]:
df

In [ ]:
#regarding to avg of "salary" in terms of "status and department"

df.groupby(["status", "dept"])["salary"].mean()

In [ ]:
df.groupby(["status", "dept"])["salary"].transform("mean")

In [ ]:
df["trans_salary"] = df.groupby(["status","dept"])["salary"].transform("mean")
df

**Let's fill the missing values at "salary" column with the mean of the group of "status" and "dept"**

In [ ]:
df.loc[:,"salary"].fillna(df['trans_salary'], inplace=True)
df

**Let's fill the missing values at "var1" column with the mean of the group of "gender" and "status"**

In [ ]:
df["var1"].fillna(df.groupby(["gender", "status"])["var1"].transform("mean"), inplace=True)
df

In [ ]:
cond = (df["gender"]=="M") & (df["status"]=="FT")
cond

In [ ]:
df.loc[cond, "var2"]

In [ ]:
df.loc[cond, "var2"].mode()[0]

In [ ]:
df.loc[cond, "var2"].fillna(df.loc[cond, "var2"].mode()[0])

In [ ]:
df["var2"]

In [ ]:
df.groupby(["status"])["var2"].mean()

In [ ]:
df.groupby(["status"])["var2"].transform("mean")

In [ ]:
df["var2"].fillna(df.groupby(["status"])["var2"].transform("mean"), inplace = True)

In [ ]:
df

## filling with Interpolation

Pandas **``dataframe.interpolate()``** function is basically used to fill NA values in the dataframe or series. But, this is a very powerful function to fill the missing values. It uses various interpolation technique to fill the missing values rather than hard-coding the value [Source 01](https://www.geeksforgeeks.org/python-pandas-dataframe-interpolate/) & [Source 02](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.interpolate.html)

In [ ]:
flights = sns.load_dataset("flights")

In [ ]:
flights

In [ ]:
flights.isnull().sum()

In [ ]:
# you don't need to know how this plotting happens.
# just focus on the time-series line

flights.passengers.plot();

In [ ]:
flights_copy = flights.copy()

In [ ]:
flights_copy.loc[np.random.randint(0, 144, 20),"passengers"] = None

In [ ]:
flights_copy.isnull().sum()

In [ ]:
flights_copy.passengers.plot();

In [ ]:
import matplotlib.pyplot as plt

In [ ]:
plt.figure(figsize = (10, 6))

flights_copy["passengers"].interpolate().plot(kind="line");

In [ ]:
plt.figure(figsize = (10, 6))

flights_copy["passengers"].fillna(method = "ffill").plot(kind="line");

In [ ]:
plt.figure(figsize = (10, 6))

flights.passengers.plot();

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:150%; text-align:center; border-radius:10px 10px;">The End of The Session - 07</p>

<a id="5"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" 
alt="CLRSWY"></p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:100%; text-align:center; border-radius:10px 10px;">WAY TO REINVENT YOURSELF</p>

________